{
    "NAV": {
        "HOME": "Inicio",
        "ABOUT_ME": "Sobre mí",
        "PERSONAL_PROJECTS": "Mis proyectos"
    },
    "FOOTER": {
        "CONTACTS": "Contactos",
        "ADRESS": "Dirección",
        "CURRICULUM": "Curriculum"
    },
    "HOME": {
        "WELCOME": "¡Hola Mundo!",
        "INTRODUCTION": "Mi nombre es",
        "OFFICE": "Desarrollador Full-Stack",
        "TEXT": "Soy un programador creativo y proactivo, apasionado por lo que hago.",
        "TEXT2": "¡Este portafolio muestra proyectos personales que me gustaría presentarte!",
        "DISCOVERY_PROJECTS": "proyectos",
        "RECENT_PROJECTS": "proyectos recientes",
        "MORE_PROJECTS": "Ver más proyectos",
        "BEST_SKILLS_TITLE": "Habilidades",
        "BEST_SKILLS_TEXT": "Idiomas y herramientas en los que tengo mayor conocimiento y experiencia",
        "BEST_SKILLS_BUTTON": "Ver otros conocimientos"
    },
    "ABOUT_ME": {
        "TITLE": "Sobre mí",
        "DEGREE":"Grado: ",
        "COLLEGE": "Ciencias de la Computación (completado - enero de 2022)",
        "YO": "Edad: ",
        "YEARS": "años",
        "SHOWMORE": "Mostrar más",
        "DESCRIPTION": "Apasionado por la tecnología desde la infancia, siempre me ha fascinado construir estructuras funcionales. Dado que en otros campos a menudo hay limitaciones a la creatividad, decidí dedicarme a la informática, donde puedo desatar mi creatividad de manera casi ilimitada. Soy un Desarrollador Full-Stack orientado a resultados, enfocado en crear soluciones de software prácticas e intuitivas para los clientes, asegurando al mismo tiempo una alta mantenibilidad para la empresa.",
        "SOFT_SKILLS": {
            "SKILL1": "Pensamiento Crítico",
            "SKILL2": "Resolución de Problemas",
            "SKILL3": "Adaptabilidad",
            "SKILL4": "Trabajo en Equipo",
            "SKILL5": "Empatía",
            "SKILL6": "Toma de Decisiones",
            "SKILL7": "Iniciativa",
            "SKILL8": "Gestión del Tiempo",
            "SKILL9": "Inteligencia Emocional",
            "SKILL10": "Persistencia",
            "SKILL11": "Transparencia",
            "SKILL12": "Flexibilidad"
        },
        "IDEIA_SISTEMAS": {
            "STACKS": "Lenguajes de programación: Visual Basic 6 / C#",
            "DATABASES": "Bases de datos utilizadas: SQL Server y MySQL",
            "FRAMEWORKS": "Frameworks: Rest API",
            "ABOUT": "En la empresa especializada en el desarrollo de sistemas de gestión empresarial (ERP), tuve la oportunidad de aprender Visual Basic 6 y utilizar esa habilidad para comenzar mi trayectoria profesional. Fue allí donde adquirí valiosa experiencia en programación y trabajé junto a un equipo altamente calificado de profesionales en el campo.",
            "STACK_DETAILS": {
                "PROJECT1": "Sistema de generación de boletos",
                "PROJECT2": "Retaguardia",
                "PROJECT3": "Punto de venta",
                "PROJECT4": "Sistema de gráficos",
                "PROJECT5": "Integración IFood"
            }
        },
        "TRULOGIC": {
            "STACKS": "Lenguajes de programación: C# / Java / Javascript / HTML / CSS",
            "DATABASES": "Bases de datos utilizadas: SQL Server y Postgres",
            "FRAMEWORKS": "Frameworks: ASP.NET / React-Native / Angular 12 / Vue.Js / Spring Boot / Hibernate / Rest API / Entity Framework",
            "WORK_METODOLOGY": "Metodología de trabajo: SCRUM",
            "ABOUT": "Trulogic fue un verdadero oasis de conocimiento y camaradería para mí. Enfocado en escuchar las necesidades e ideas de sus clientes y convertirlas en realidad, Trulogic me brindó una amplia variedad de proyectos y, como resultado, una gran cantidad de conocimientos y habilidades adquiridas. Tuve la oportunidad de trabajar con varias herramientas altamente utilizadas en la industria, lo que impulsó significativamente mi trayectoria como desarrollador.",
            "STACK_DETAILS": {
                "PROJECT1": "Portal Telemedicina (Sistema Hospitalario)",
                "PROJECT2": "Prático (Sistema de gestión)",
                "PROJECT3": "Lentec (Monitoreo automatizado)",
                "PROJECT4": "App da Turma (Sistema de gestión de graduaciones)"
            }
        }
    },
    "CONTACTS": {
        "TITLE": "¡No dudes en contactarme!",
        "CONTACTS": "Mis contactos",
        "BASED_IN": "Ubicado en",
        "SEND_EMAIL": "Enviar correo electrónico",
        "DOWNLOAD_CURRICULUM": "Descargar mi currículum",
        "SUCESS_SEND_EMAIL": "Correo electrónico enviado con éxito. Muchas gracias.",
        "ERROR_SEND_EMAIL": "Se produjo un error al enviar el correo electrónico, inténtelo nuevamente más tarde.",
        "PLACEHOLDER_NAME": "Nombre",
        "PLACEHOLDER_EMAIL": "tuEmail@email.com",
        "PLACEHOLDER_MESSAGE": "Mensaje"
    },
    "PERSONAL_PROJECTS": {
        "TITLE": "Mis proyectos",
        "RPG_SURVIVAL_GAME": {
            "RESUME": "Juego hecho en Unity3D",
            "TITLE": "RPG de supervivencia",
            "TEXT1": "Proyecto realizado en el motor Unity 3D utilizando el lenguaje C#.",
            "TEXT2": "Este juego tiene un tema de fantasía medieval con un estilo visual basado en caricaturas. Inspirado en éxitos como Terraria y Dark Souls, el juego contará con una historia rica con elementos de fantasía y aventura que cautivarán al jugador de principio a fin. Con una atmósfera envolvente y visualmente cautivadora, el juego ofrecerá una experiencia única y atractiva para los fanáticos de los RPG de acción.",
            "TEXT3": "El juego cuenta con un completo sistema de gestión de inventario con una mecánica de elaboración que permite al jugador crear nuevo equipamiento y herramientas a partir de los recursos recolectados durante la exploración. Además, el juego incluye un sistema de equipamiento que permite al jugador personalizar el personaje con armaduras y armas poderosas, así como la capacidad de construir estructuras y fortificaciones para proteger al personaje y crear un entorno más seguro para la exploración. Con estas características, el jugador tendrá un control total sobre su personaje y podrá experimentar con diferentes estrategias para enfrentar los desafíos del juego.",
            "TEXT4": "Este juego tendrá una jugabilidad altamente centrada en la exploración del mapa y en la obtención de botín de monstruos, donde el jugador encontrará una amplia variedad de recursos dispersos por el entorno. Estos recursos se pueden recolectar y utilizar para crear nuevo equipamiento y herramientas que ayuden en la supervivencia y exploración del personaje. Con esta dinámica de juego, el jugador estará constantemente desafiado a explorar cada rincón del mapa en busca de nuevos recursos y enfrentar a poderosos monstruos para obtener objetos valiosos, lo que proporcionará una experiencia emocionante e inmersiva.",
            "TEXT5": "Además, el juego contará con una amplia variedad de equipamiento que el jugador podrá utilizar para defenderse de los ataques de los monstruos que habitan en el mapa, incluyendo armas convencionales y armas mágicas con habilidades especiales. Con esta extensa gama de equipamiento disponible, el jugador tendrá muchas opciones para personalizar su personaje y enfrentar diferentes desafíos con estrategias únicas, lo que hará que la jugabilidad sea aún más emocionante y diversa.",
            "VIDEO_TITLE1": "Descripción general del juego",
            "VIDEO_TITLE2": "Actualización: Sistema de elaboración"
        },
        "BOMBERMAN_ECOLOGICO": {
            "RESUME": "Juego hecho en Java",
            "TITLE": "Bomberman ecológico",
            "TEXT1": "Proyecto realizado en Java utilizando predominantemente la biblioteca Swing.",
            "TEXT2": "Fue creado para ser presentado como uno de los proyectos del semestre en la universidad (4º semestre).",
            "TEXT3": "Este juego es una emocionante mezcla del clásico Bomberman y un sistema de puzzles, donde el jugador debe recolectar todos los objetos de la escena para completar cada nivel. Sin embargo, la jugabilidad es más desafiante de lo que parece, ya que hay obstáculos que solo se pueden superar detonando las bombas que lleva el personaje. Para hacer el juego aún más estratégico, las bombas son limitadas y el jugador debe usarlas inteligentemente para destruir los obstáculos correctos y recolectar todos los objetos dispersos por el nivel. Con esta dinámica, el juego se convierte en un verdadero puzzle, que requiere estrategia y pensamiento crítico del jugador para superar cada desafío.",
            "FONT_CODE": "Código fuente",
            "DOWNLOAD_GAME": "Descargar juego"
        },
        "ORDER_MANAGEMENT": {
            "RESUME": "Proyecto full-stack para gestión de pedidos",
            "TITLE": "Sistema de Gestión de Pedidos",
            "TEXT1": "Este proyecto presenta dos variantes, ambas compartiendo el mismo frontend pero diferenciándose en los backends, una implementada en Java y la otra en .NET. Ambas aplicaciones utilizan API REST como estilo de arquitectura de software.",
            "TEXT2": "Versión AngularJs / Java",
            "TEXT3": "Un sistema que utiliza AngularJS en el frontend y Java con Spring Boot en el backend. Para mejorar la eficiencia del desarrollo, se han incorporado herramientas poderosas como Lombok, Swagger y Hibernate. Esta combinación de tecnologías proporciona una experiencia de desarrollo ágil y efectiva, garantizando la calidad y escalabilidad del sistema.",
            "TEXT4": "Versión AngularJs / .NET",
            "TEXT5": "El sistema está construido con AngularJS en el frontend y .NET en el backend, también integrando Swagger para mejorar la documentación y facilitar la interacción con la API.",
            "FONT_CODE1": "Código Fuente con Java",
            "FONT_CODE2": "Código Fuente con .NET"
        },
        "EXCHANGE_RATE": {
            "RESUME": "Proyecto full-stack para comparar historial de cambio de monedas",
            "TITLE": "Filtro de cotización por moneda",
            "TEXT1": "Tecnologías utilizadas: Angular 12 / Java",
            "TEXT2": "Desarrollé un proyecto simple que filtra por fecha para la moneda seleccionada y resta valores según el tipo de cambio actual. Además, es posible mostrar solo los valores inferiores al tipo de cambio actual. Este sistema fue construido utilizando Angular 12 exclusivamente para el frontend y Java Spring Boot para el backend.",
            "FONT_CODE": "Código Fuente"
        },
        "PORTFOLIO": {
            "RESUME": "Proyecto de front-end de mi propio portafolio",
            "TITLE": "Mi Propio Portafolio",
            "TEXT1": "Tecnología Utilizada: ReactJS",
            "TEXT2": "Este portafolio fue construido exclusivamente con ReactJS, representando mi primer encuentro con un framework de desarrollo web. A través de él, mejoré significativamente mis habilidades en desarrollo web. Actualizado continuamente, el portafolio incorpora nuevas funcionalidades y contenido que ofrecen una visión integral de mi trayectoria y habilidades.",
            "FONT_CODE": "Código Fuente"
        },
        "CRUD_REACTJS": {
            "RESUME": "Proyecto full-stack para gestión de registros y inicio de sesión",
            "TITLE": "Sistema de Registro y Inicio de Sesión",
            "TEXT1": "Tecnologías Utilizadas: ReactJS / .NET",
            "TEXT2": "Desarrollé este sistema de registro simplificado, que abarca todas las operaciones básicas de una aplicación (CRUD) e incorpora la funcionalidad de inicio de sesión, con soporte para la emisión y validación de tokens durante el proceso de autenticación del usuario. Utilicé las tecnologías ReactJS y ASP.NET para la realización de esta aplicación.",
            "FONT_CODE": "Código Fuente"
        }
    }
}